/* 学号 姓名 班级 */
#include <iostream>
#include <conio.h>
#include "7-b6.h"
using namespace std;

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动，测试时会替换
***************************************************************************/
int main()
{
	if (1) {
		Date d1;				//2000.1.1
		Date d2(2025, 6, 12);	//2025.6.12

		cout << "无参及三参构造函数测试（完全正确）" << endl;
		cout << "==================================" << endl;

		cout << "d1应该是2000.1.1， 实际为：";
		d1.show();
		cout << "d2应该是2025.6.12，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1870, 3, 15);  //2000.3.15
		Date d2(2112, 3, 4);   //2000.3.4
		Date d3(2025, 13, 15); //2025.1.15
		Date d4(2025, 12, 32); //2025.12.1

		cout << "三参构造函数测试（年、月、日非法）" << endl;
		cout << "==================================" << endl;

		cout << "d1应该是2000.3.15，实际为：";
		d1.show();
		cout << "d2应该是2000.3.4， 实际为：";
		d2.show();
		cout << "d3应该是2025.1.15，实际为：";
		d3.show();
		cout << "d4应该是2025.12.1，实际为：";
		d4.show();

		/* 多个错，按年月日顺序处理 */
		Date d5(1899, 2, 29);  //2000.2.29
		Date d6(1899, 2, 30);  //2000.2.1
		Date d7(1899, 13, 31); //2000.1.31
		Date d8(1899, 13, 32); //2000.1.1
		cout << "d5应该是2000.2.29，实际为：";
		d5.show();
		cout << "d6应该是2000.2.1， 实际为：";
		d6.show();
		cout << "d7应该是2000.1.31，实际为：";
		d7.show();
		cout << "d8应该是2000.1.1， 实际为：";
		d8.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2025, 2, 29); //2025.2.1
		Date d2(2024, 2, 29); //2024.2.29

		cout << "三参构造函数测试（闰年）" << endl;
		cout << "========================" << endl;

		cout << "d1应该是2025.2.1， 实际为：";
		d1.show();
		cout << "d2应该是2024.2.29，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1);          //1900.1.1
		Date d2(73049);      //2099.12.31
		Date d3(-100);       //1900.1.1
		Date d4(80000);      //2099.12.31
		Date d5(30000);      //1982.2.19
		Date d6(45819);      //2025.6.12

		cout << "一参构造函数测试，包括合法及非法值" << endl;
		cout << "==================================" << endl;

		cout << "d1应该是1900.1.1，  实际为：";
		d1.show();
		cout << "d2应该是2099.12.31，实际为：";
		d2.show();
		cout << "d3应该是1900.1.1，  实际为：";
		d3.show();
		cout << "d4应该是2099.12.31，实际为：";
		d4.show();
		cout << "d5应该是1982.2.19， 实际为：";
		d5.show();
		cout << "d6应该是2025.6.12， 实际为：";
		d6.show();

		wait_for_enter();
	}

	if (1) {
		Date d1, d2, d3; //都是2000.1.1

		cout << "测试set，带缺省值" << endl;
		cout << "=================" << endl;

		d1.set(2025, 6, 12);	//2025.6.12
		d2.set(2025, 6);		//2025.6.1
		d3.set(2025);			//2025.1.1

		cout << "d1应该是2025.6.12，实际为：";
		d1.show();
		cout << "d2应该是2025.6.1， 实际为：";
		d2.show();
		cout << "d3应该是2025.1.1， 实际为：";
		d3.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2025,6,12), d2(d1), d3(d1); //都是2025.6.12

		cout << "测试set，带0值" << endl;
		cout << "==============" << endl;

		d1.set(2024, 0, 1);		//2024.6.1
		d2.set(0, 3, 18);		//2025.3.18
		d3.set(0, 0, 17);		//2025.6.17

		cout << "d1应该是2024.6.1， 实际为：";
		d1.show();
		cout << "d2应该是2025.3.18，实际为：";
		d2.show();
		cout << "d3应该是2025.6.17，实际为：";
		d3.show();

		wait_for_enter();
	}

	if (1) {
		Date d1, d2, d3, d4;

		cout << "测试set，年、月、日一个非法" << endl;
		cout << "===========================" << endl;

		d1.set(2112, 2, 29);  //2000.2.29
		d2.set(2025, 2, 29);  //2025.2.1
		d3.set(2025, 6, 32);  //2025.6.1
		d4.set(2025, 13, 12); //2025.1.12

		cout << "d1应该是2000.2.29， 实际为：";
		d1.show();
		cout << "d2应该是2025.2.1，  实际为：";
		d2.show();
		cout << "d3应该是2025.6.1，  实际为：";
		d3.show();
		cout << "d4应该是2025.1.12， 实际为：";
		d4.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2025, 6, 12), d2(d1), d3(d1), d4(d1);  //2025.6.12

		cout << "测试set，年、月、日多个非法" << endl;
		cout << "===========================" << endl;
		/* 多个错+带缺省值，按年月日顺序处理 */

		d1.set(1899, 2, 30);  //2000.2.1
		cout << "d1应该是2000.2.1， 实际为：";
		d1.show();
		d2.set(2025, 13, 31);  //2025.1.31
		cout << "d2应该是2025.1.31，实际为：";
		d2.show();
		d3.set(2025, 13, 32);  //2025.1.1
		cout << "d3应该是2025.1.1， 实际为：";
		d3.show();
		d4.set(2112, 13, 32);  //2000.1.1
		cout << "d4应该是2000.2.1， 实际为：";
		d4.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2025, 6, 12), d2(d1), d3(d1), d4(d1), d5(d1);  //2025.6.12

		cout << "测试set，年、月、日(错误+含0) " << endl;
		cout << "==============================" << endl;

		d1.set(1899, 0, 0);   //2000.6.12
		cout << "d1应该是2000.6.12， 实际为：";
		d1.show();
		d2.set(1899, 0, 31);  //2000.6.1
		cout << "d2应该是2000.6.1，  实际为：";
		d2.show();
		d3.set(0, 13, 0);      //2025.1.12
		cout << "d3应该是2025.1.12， 实际为：";
		d3.show();
		d4.set(0, 13, 32);    //2025.1.1
		cout << "d4应该是2025.1.1，  实际为：";
		d4.show();
		d5.set(0, 0, 31);     //2025.6.1
		cout << "d5应该是2025.6.1，  实际为：";
		d5.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2025, 6, 12);
		int y, m, d;

		cout << "测试get" << endl;
		cout << "=======" << endl;

		d1.get(y, m, d);
		cout << "应该y=2025,m=6,d=12，实际为：";
		cout << "y=" << y << ",m=" << m << ",d=" << d << endl;

		wait_for_enter();
	}

	return 0;
}
